


dependencies
| join kind = leftouter
  (exceptions)
on $left.operation_Id == $right.operation_Id

#################
##################
SecurityEvent
| where EventID == "4624"
| summarize LogOnCount=count() by EventID, Account
| project LogOnCount, Account
| join kind = inner (
     SecurityEvent
     | where EventID == "4634"
     | summarize LogOffCount=count() by EventID, Account
     | project LogOffCount, Account
) on Account

###################
##################


DeviceFileEvents
| where DeviceName == "devicename"
| where FileName contains ".exe"  // name of the file
| project TimeGenerated, InitiatingProcessAccountUpn, InitiatingProcessAccountName, FileName, ActionType, DeviceName, InitiatingProcessAccountDomain,FileSize, InitiatingProcessCommandLine, InitiatingProcessFolderPath, InitiatingProcessSHA256
// adding join another table you can get the source IP
| join kind = inner (
     DeviceInfo
     | where DeviceName == "devicename" // you have to add the exact device as the table DeviceFileEvents
     | project PublicIP, IsAzureADJoined, OSPlatform, DeviceName
) on DeviceName
