AuditLogs
| where OperationName has_any ('password')
| extend AccountType = tostring(TargetResources[0].type), Account = tostring(TargetResources[0].userPrincipalName),
TargetUserName = tolower(tostring(TargetResources[0].displayName))
| where Account == "<UPN>"
| project TimeGenerated, Account, Result, OperationName, ResultDescription, AdditionalDetails, InitiatedBy, LoggedByService, ResultReason

// Change or Reset Passwords Attempts
// Counts change/reset paswords attempts per target account.
SecurityEvent
| where EventID in (4723, 4724)
| summarize count() by TargetAccount


###### AD user enabled and password not set within 48 hours ####

AuditLogs
| where parse_json(tostring(InitiatedBy.user)).userPrincipalName == "user"




AuditLogs
| extend userPrincipalName_ = tostring(TargetResources[0].userPrincipalName)
| where OperationName == "Add member to group"


AuditLogs
| where parse_json(tostring(InitiatedBy.user)).userPrincipalName == "user"
| where TargetResources[0].userPrincipalName == "user"



AuditLogs
| where parse_json(tostring(InitiatedBy.user)).userPrincipalName contains "username"
| where OperationName contains "Add"
| where TargetResources[0].userPrincipalName contains "user"
