### Rare RDP Connections ###


DeviceNetworkEvents
| where RemotePort == "3389"
| where LocalIP contains "PrivateIP"
| project TimeGenerated, InitiatingProcessIntegrityLevel, ActionType, InitiatingProcessAccountUpn, DeviceName,LocalIP,LocalIPType, LocalPort, RemoteIP, RemoteIPType, RemotePort, RemoteUrl,InitiatingProcessCommandLine, InitiatingProcessFileName, InitiatingProcessFolderPath






SecurityEvent
| where Account contains "nameaccount"
| where LogonTypeName contains "RemoteInteractive"




SecurityEvent
| where (EventID == 4625 or EventID== 4624) and WorkstationName == "nameworkstation"
| project TimeGenerated, EventID , WorkstationName,Computer, Account , LogonTypeName , IpAddress
| order by TimeGenerated desc





DeviceNetworkEvents   # This table is part of Microsoft Defender for Endpoints with Azure Sentinel.
#This table contains Network properties of machines, including adapters, IP and MAC addresses,
# as well as connected networks and domains. ###
